# Gözlem ve Değişken Seçimi (loc & iloc)

In [58]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29
4    21    23    18
5     4     5    22
6    29     9    13
7     7     3    18
8     2    23     2
9     3     4    12

In [65]:
#loc : Alışık olduğumuz indeksleme mantığından farklı bir şekilde çalışır.Yani inclusive - exclusive mantığı burda yoktur.
#Kısaca nasıl tanımlandı ise o şekilde seçim yapma olanağına sahiptir.

In [61]:
df.loc[0:3]

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29

In [71]:
#iloc: İndeksleme mantığı ile çalışır.

In [72]:
df.iloc[0:3]

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28

In [68]:
df.iloc[0,0]

np.int32(16)

In [69]:
df

   var1  var2  var3
0    16    10    11
1    17    10     1
2    20     3    28
3     2    21    29
4    21    23    18
5     4     5    22
6    29     9    13
7     7     3    18
8     2    23     2
9     3     4    12

In [70]:
df.iloc[:3,:2]

   var1  var2
0    16    10
1    17    10
2    20     3

In [74]:
df.loc[0:3, "var3"]

0    11
1     1
2    28
3    29
Name: var3, dtype: int32

In [78]:
df.iloc[0:3]["var3"]

0    11
1     1
2    28
Name: var3, dtype: int32